# Load Dataset

In [22]:
import os
import pandas as pd

HOUSING_PATH = "../datasets"

def load_housing_data(file):
    csv_path = os.path.join(HOUSING_PATH, file)
    return pd.read_csv(csv_path)

In [25]:
df = load_housing_data("housing_in_london_monthly_variables.csv")
df.head()

,date,area,average_price,code,houses_sold,no_of_crimes,borough_flag
0,1995-01-01,city of london,91449,E09000001,17.0,NaN,1
1,1995-02-01,city of london,82203,E09000001,7.0,NaN,1
2,1995-03-01,city of london,79121,E09000001,14.0,NaN,1
3,1995-04-01,city of london,77101,E09000001,7.0,NaN,1
4,1995-05-01,city of london,84409,E09000001,10.0,NaN,1

## Explore Dataset

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13549 entries, 0 to 13548
Data columns (total 7 columns):
date             13549 non-null object
area             13549 non-null object
average_price    13549 non-null int64
code             13549 non-null object
houses_sold      13455 non-null float64
no_of_crimes     7439 non-null float64
borough_flag     13549 non-null int64
dtypes: float64(2), int64(2), object(3)
memory usage: 741.1+ KB